[Killed] BooleanLiteral
trybe-exercicios-repos/exercise-digimon-finders/src/App.js:56:25
           Search Digimon
         </button>
         {
-          isFetching && !errorMessage
+          isFetching && errorMessage
             ? <Digimon digimon={ digimon } />
             : <h1>{errorMessage || 'Faça uma pesquisa'}</h1>
